RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_sdioc.c
/**
 *******************************************************************************
 * @file  hc32_ll_sdioc.c
 * @brief This file provides firmware functions to manage the Secure Digital
 *        Input and Output Controller(SDIOC).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-03-31       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_sdioc.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_SDIOC SDIOC
 * @brief SDIOC Driver Library
 * @{
 */

#if (LL_SDIOC_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup SDIOC_Local_Macros SDIOC Local Macros
 * @{
 */

/* Masks for R6 Response */
#define SDMMC_R6_GEN_UNKNOWN_ERR                (0x00002000UL)
#define SDMMC_R6_ILLEGAL_CMD                    (0x00004000UL)
#define SDMMC_R6_COM_CRC_FAIL                   (0x00008000UL)

/* SDMMC command parameters */
#define SDMMC_CMD8_CHECK_PATTERN                (0x000001AAUL)
/* 3.2V-3.3V */
#define SDMMC_ACMD41_VOLT_WIN                   (0x80100000UL)

/* Command send and response timeout(ms) */
#define SDMMC_CMD_TIMEOUT                       (5000UL)
/* Max erase Timeout 60s */
#define SDMMC_MAX_ERASE_TIMEOUT                 (60000UL)
/* SDIOC software reset timeout(ms) */
#define SDIOC_SW_RST_TIMEOUT                    (50UL)

/* SDIOC NORINTSGEN register Mask */
#define SDIOC_NORINTSGEN_CLR_MASK               (0x01F7U)
/* SDIOC ERRINTSGEN register Mask */
#define SDIOC_ERRINTSGEN_CLR_MASK               (0x017FU)

/*!< Get the specified register address of the specified SDIOC unit */
#define SDIOC_ARG_ADDR(__UNIT__)                (__IO uint32_t*)((uint32_t)(&((__UNIT__)->ARG0)))
#define SDIOC_BUF_ADDR(__UNIT__)                (__IO uint32_t*)((uint32_t)(&((__UNIT__)->BUF0)))
#define SDIOC_RESP_ADDR(__UNIT__, __RESP__)     (__IO uint32_t*)((uint32_t)(&((__UNIT__)->RESP0)) + (__RESP__))

/**
 * @defgroup SDIOC_Check_Parameters_Validity SDIOC Check Parameters Validity
 * @{
 */
#define IS_SDIOC_UNIT(x)                                                       \
(   ((x) == CM_SDIOC1)                          ||                             \
    ((x) == CM_SDIOC2))

#define IS_SDIOC_MD(x)                                                         \
(   ((x) == SDIOC_MD_SD)                        ||                             \
    ((x) == SDIOC_MD_MMC))

#define IS_SDIOC_CARD_DETECT_WAY(x)                                            \
(   ((x) == SDIOC_CARD_DETECT_CD_PIN_LVL)       ||                             \
    ((x) == SDIOC_CARD_DETECT_TEST_SIGNAL))

#define IS_SDIOC_CARD_DETECT_TEST_LEVEL(x)                                     \
(   ((x) == SDIOC_CARD_DETECT_TEST_LVL_LOW)     ||                             \
    ((x) == SDIOC_CARD_DETECT_TEST_LVL_HIGH))

#define IS_SDIOC_SPEED_MD(x)                                                   \
(   ((x) == SDIOC_SPEED_MD_NORMAL)              ||                             \
    ((x) == SDIOC_SPEED_MD_HIGH))

#define IS_SDIOC_BUS_WIDTH(x)                                                  \
(   ((x) == SDIOC_BUS_WIDTH_1BIT)               ||                             \
    ((x) == SDIOC_BUS_WIDTH_4BIT)               ||                             \
    ((x) == SDIOC_BUS_WIDTH_8BIT))

#define IS_SDIOC_CLK_DIV(x)                                                    \
(   ((x) == SDIOC_CLK_DIV1)                     ||                             \
    ((x) == SDIOC_CLK_DIV2)                     ||                             \
    ((x) == SDIOC_CLK_DIV4)                     ||                             \
    ((x) == SDIOC_CLK_DIV8)                     ||                             \
    ((x) == SDIOC_CLK_DIV16)                    ||                             \
    ((x) == SDIOC_CLK_DIV32)                    ||                             \
    ((x) == SDIOC_CLK_DIV64)                    ||                             \
    ((x) == SDIOC_CLK_DIV128)                   ||                             \
    ((x) == SDIOC_CLK_DIV256))

#define IS_SDIOC_CMD_TYPE(x)                                                   \
(   ((x) == SDIOC_CMD_TYPE_NORMAL)              ||                             \
    ((x) == SDIOC_CMD_TYPE_SUSPEND)             ||                             \
    ((x) == SDIOC_CMD_TYPE_RESUME)              ||                             \
    ((x) == SDIOC_CMD_TYPE_ABORT))

#define IS_SDIOC_DATA_LINE(x)                                                  \
(   ((x) == SDIOC_DATA_LINE_DISABLE)            ||                             \
    ((x) == SDIOC_DATA_LINE_ENABLE))

#define IS_SDIOC_TRANS_DIR(x)                                                  \
(   ((x) == SDIOC_TRANS_DIR_TO_CARD)            ||                             \
    ((x) == SDIOC_TRANS_DIR_TO_HOST))

#define IS_SDIOC_AUTO_SEND_CMD12(x)                                            \
(   ((x) == SDIOC_AUTO_SEND_CMD12_DISABLE)      ||                             \
    ((x) == SDIOC_AUTO_SEND_CMD12_ENABLE))

#define IS_SDIOC_TRANS_MD(x)                                                   \
(   ((x) == SDIOC_TRANS_MD_SINGLE)              ||                             \
    ((x) == SDIOC_TRANS_MD_INFINITE)            ||                             \
    ((x) == SDIOC_TRANS_MD_MULTI)               ||                             \
    ((x) == SDIOC_TRANS_MD_STOP_MULTI))

#define IS_SDIOC_DATA_TIMEOUT_TIME(x)           ((x) <= SDIOC_DATA_TIMEOUT_CLK_2E27)

#define IS_SDIOC_RESP_REG(x)                                                   \
(   ((x) == SDIOC_RESP_REG_BIT0_31)             ||                             \
    ((x) == SDIOC_RESP_REG_BIT32_63)            ||                             \
    ((x) == SDIOC_RESP_REG_BIT64_95)            ||                             \
    ((x) == SDIOC_RESP_REG_BIT96_127))

