RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_sdioc.c
#define IS_SDIOC_SW_RST_TYPE(x)                                                \
(   ((x) == SDIOC_SW_RST_DATA_LINE)             ||                             \
    ((x) == SDIOC_SW_RST_CMD_LINE)              ||                             \
    ((x) == SDIOC_SW_RST_ALL))

#define IS_SDIOC_OUTPUT_CLK_FREQ(x)                                            \
(   ((x) == SDIOC_OUTPUT_CLK_FREQ_400K)         ||                             \
    ((x) == SDIOC_OUTPUT_CLK_FREQ_25M)          ||                             \
    ((x) == SDIOC_OUTPUT_CLK_FREQ_26M)          ||                             \
    ((x) == SDIOC_OUTPUT_CLK_FREQ_50M)          ||                             \
    ((x) == SDIOC_OUTPUT_CLK_FREQ_52M))

#define IS_SDIOC_GET_HOST_FLAG(x)                                              \
(   ((x) != 0UL)                                &&                             \
    (((x) | SDIOC_HOST_FLAG_ALL) == SDIOC_HOST_FLAG_ALL))

#define IS_SDIOC_GET_INT_FLAG(x)                                               \
(   ((x) != 0UL)                                &&                             \
    (((x) | SDIOC_INT_FLAG_ALL) == SDIOC_INT_FLAG_ALL))

#define IS_SDIOC_CLR_INT_FLAG(x)                                               \
(   ((x) != 0UL)                                &&                             \
    (((x) | SDIOC_INT_FLAG_CLR_ALL) == SDIOC_INT_FLAG_CLR_ALL))

#define IS_SDIOC_INT(x)                                                        \
(   ((x) != 0UL)                                &&                             \
    (((x) | SDIOC_INT_ALL) == SDIOC_INT_ALL))

#define IS_SDIOC_AUTO_CMD_ERR_FLAG(x)                                          \
(   ((x) != 0UL)                                &&                             \
    (((x) | SDIOC_AUTO_CMD_ERR_FLAG_ALL) == SDIOC_AUTO_CMD_ERR_FLAG_ALL))

#define IS_SDIOC_FORCE_AUTO_CMD_ERR(x)                                         \
(   ((x) != 0UL)                                &&                             \
    (((x) | SDIOC_FORCE_AUTO_CMD_ERR_ALL) == SDIOC_FORCE_AUTO_CMD_ERR_ALL))

#define IS_SDIOC_FORCE_ERR_INT(x)                                              \
(   ((x) != 0UL)                                &&                             \
    (((x) | SDIOC_FORCE_ERR_INT_ALL) == SDIOC_FORCE_ERR_INT_ALL))

#define IS_SDIOC_RESP_TYPE(x)                                                  \
(   ((x) == SDIOC_RESP_TYPE_NO)                 ||                             \
    ((x) == SDIOC_RESP_TYPE_R2)                 ||                             \
    ((x) == SDIOC_RESP_TYPE_R3_R4)              ||                             \
    ((x) == SDIOC_RESP_TYPE_R1_R5_R6_R7)        ||                             \
    ((x) == SDIOC_RESP_TYPE_R1B_R5B))

#define IS_SDIOC_CMD_INDEX(x)                   ((x) < 0x40U)

#define IS_SDIOC_BLOCK_SIZE(x)                  (((x) >= 1U) && ((x) <= 512U))

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup SDIOC_Global_Functions SDIOC Global Functions
 * @{
 */

/**
 * @brief  Wait for command response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32CheckFlag            Check flags
 *         This parameter can be one or any combination the following values:
 *           @arg SDIOC_INT_FLAG_CC:    Command Complete status
 *           @arg SDIOC_INT_FLAG_CIE:   Command Index error status
 *           @arg SDIOC_INT_FLAG_CEBE:  Command End Bit error status
 *           @arg SDIOC_INT_FLAG_CCE:   Command CRC error status
 *           @arg SDIOC_INT_FLAG_CTOE:  Command Timeout error status
 * @param  [in] u32Timeout              Timeout time(ms) for waiting SDIOC
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: The response is normal received
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
static int32_t SDMMC_WaitResponse(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32CheckFlag,
                                  uint32_t u32Timeout, uint32_t *pu32ErrStatus)
{
    __IO uint32_t u32Count;
    int32_t i32Ret = LL_OK;
    uint32_t u32Temp;

    *pu32ErrStatus = 0UL;
    /* The u32Timeout is expressed in ms */
    u32Count = u32Timeout * (HCLK_VALUE / 20000UL);
    while (RESET == SDIOC_GetIntStatus(SDIOCx, u32CheckFlag)) {
        if (0UL == u32Count) {
            i32Ret = LL_ERR_TIMEOUT;
            break;
        }
        u32Count--;
    }

    if (LL_OK == i32Ret) {
        i32Ret = LL_ERR;
        u32Temp = CLR_REG32_BIT(u32CheckFlag, SDIOC_INT_FLAG_CC);
        if (RESET == SDIOC_GetIntStatus(SDIOCx, u32Temp)) {
            /* No error flag set */
            *pu32ErrStatus = SDMMC_ERR_NONE;
            SDIOC_ClearIntStatus(SDIOCx, SDIOC_INT_STATIC_FLAGS);
            i32Ret = LL_OK;
        } else if ((RESET != SDIOC_GetIntStatus(SDIOCx, SDIOC_INT_FLAG_CIE)) &&
                   (SDIOC_INT_FLAG_CIE == (u32CheckFlag & SDIOC_INT_FLAG_CIE))) {
            *pu32ErrStatus = SDMMC_ERR_CMD_INDEX;
            SDIOC_ClearIntStatus(SDIOCx, SDIOC_INT_FLAG_CIE);
        } else if ((RESET != SDIOC_GetIntStatus(SDIOCx, SDIOC_INT_FLAG_CEBE)) &&
                   (SDIOC_INT_FLAG_CEBE == (u32CheckFlag & SDIOC_INT_FLAG_CEBE))) {
            *pu32ErrStatus = SDMMC_ERR_CMD_STOP_BIT;
            SDIOC_ClearIntStatus(SDIOCx, SDIOC_INT_FLAG_CEBE);
        } else if ((RESET != SDIOC_GetIntStatus(SDIOCx, SDIOC_INT_FLAG_CCE)) &&
                   (SDIOC_INT_FLAG_CCE == (u32CheckFlag & SDIOC_INT_FLAG_CCE))) {
            *pu32ErrStatus = SDMMC_ERR_CMD_CRC_FAIL;
            SDIOC_ClearIntStatus(SDIOCx, SDIOC_INT_FLAG_CCE);
        } else {
            *pu32ErrStatus = SDMMC_ERR_CMD_TIMEOUT;
            SDIOC_ClearIntStatus(SDIOCx, SDIOC_INT_FLAG_CTOE);
        }
    }

    return i32Ret;
}

/**
 * @brief  Checks for error conditions for no response command.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
static int32_t SDMMC_GetCmdError(CM_SDIOC_TypeDef *SDIOCx)
{
    __IO uint32_t u32Count;
    int32_t i32Ret = LL_OK;

    /* The SDMMC_CMD_TIMEOUT is expressed in ms */
    u32Count = SDMMC_CMD_TIMEOUT * (HCLK_VALUE / 20000UL);
    while (RESET == SDIOC_GetIntStatus(SDIOCx, SDIOC_INT_FLAG_CC)) {
        if (0UL == u32Count) {
            i32Ret = LL_ERR_TIMEOUT;
            break;
        }
        u32Count--;
    }
    if (LL_OK == i32Ret) {
        SDIOC_ClearIntStatus(SDIOCx, SDIOC_INT_STATIC_FLAGS);
    }

    return i32Ret;
}

/**
 * @brief  Checks for error conditions for R1 response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32Timeout              Timeout time(ms) for waiting SDIOC
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: The response is normal received
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
static int32_t SDMMC_GetCmdResp1(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32Timeout, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    uint32_t u32RespVal;

    i32Ret = SDMMC_WaitResponse(SDIOCx, (SDIOC_INT_FLAG_CC  | SDIOC_INT_FLAG_CIE | SDIOC_INT_FLAG_CEBE |
                                         SDIOC_INT_FLAG_CCE | SDIOC_INT_FLAG_CTOE), u32Timeout, pu32ErrStatus);
    if (LL_OK == i32Ret) {
        /* Fetch has received a response. */
        (void)SDIOC_GetResponse(SDIOCx, SDIOC_RESP_REG_BIT0_31, &u32RespVal);
        if (0UL != (u32RespVal & SDMMC_ERR_BITS_MASK)) {
            *pu32ErrStatus = u32RespVal & SDMMC_ERR_BITS_MASK;
            i32Ret = LL_ERR;
        }
    }

    return i32Ret;
}

/**
 * @brief  Checks for error conditions for R1 response with busy.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32Timeout              Timeout time(ms) for waiting SDIOC
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: The response is normal received
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
static int32_t SDMMC_GetCmdResp1Busy(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32Timeout, uint32_t *pu32ErrStatus)
{
    __IO uint32_t u32Count;
    int32_t i32Ret;
    uint32_t u32RespVal;

    i32Ret = SDMMC_WaitResponse(SDIOCx, (SDIOC_INT_FLAG_CC  | SDIOC_INT_FLAG_CIE | SDIOC_INT_FLAG_CEBE |
                                         SDIOC_INT_FLAG_CCE | SDIOC_INT_FLAG_CTOE), u32Timeout, pu32ErrStatus);
    if (LL_OK == i32Ret) {
        /* Fetch has received a response. */
        (void)SDIOC_GetResponse(SDIOCx, SDIOC_RESP_REG_BIT0_31, &u32RespVal);
        if (0UL != (u32RespVal & SDMMC_ERR_BITS_MASK)) {
            *pu32ErrStatus = u32RespVal & SDMMC_ERR_BITS_MASK;
            i32Ret = LL_ERR;
        } else {
            /* Wait for busy status to release */
            u32Count = u32Timeout * (HCLK_VALUE / 20000UL);
            while (RESET == SDIOC_GetHostStatus(SDIOCx, SDIOC_HOST_FLAG_DATL_D0)) {
                if (0UL == u32Count) {
                    i32Ret = LL_ERR_TIMEOUT;
                    break;
                }
                u32Count--;
            }
        }
    }

    return i32Ret;
}

/**
 * @brief  Checks for error conditions for R2(CID or CSD) response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: The response is normal received
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
static int32_t SDMMC_GetCmdResp2(CM_SDIOC_TypeDef *SDIOCx, uint32_t *pu32ErrStatus)
{
    return SDMMC_WaitResponse(SDIOCx, (SDIOC_INT_FLAG_CC | SDIOC_INT_FLAG_CEBE | SDIOC_INT_FLAG_CCE |
                                       SDIOC_INT_FLAG_CTOE), SDMMC_CMD_TIMEOUT, pu32ErrStatus);
}

/**
 * @brief  Checks for error conditions for R3(OCR) response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: The response is normal received
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
static int32_t SDMMC_GetCmdResp3(CM_SDIOC_TypeDef *SDIOCx, uint32_t *pu32ErrStatus)
{
    return SDMMC_WaitResponse(SDIOCx, (SDIOC_INT_FLAG_CC | SDIOC_INT_FLAG_CEBE | SDIOC_INT_FLAG_CTOE),
                              SDMMC_CMD_TIMEOUT, pu32ErrStatus);
}

/**
 * @brief  Checks for error conditions for R6(RCA) response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [out] pu16RCA                Pointer to a value of device RCA
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: The response is normal received
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
static int32_t SDMMC_GetCmdResp6(CM_SDIOC_TypeDef *SDIOCx, uint16_t *pu16RCA, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    uint32_t u32RespVal;

    i32Ret = SDMMC_WaitResponse(SDIOCx, (SDIOC_INT_FLAG_CC  | SDIOC_INT_FLAG_CIE | SDIOC_INT_FLAG_CEBE |
                                         SDIOC_INT_FLAG_CCE | SDIOC_INT_FLAG_CTOE), SDMMC_CMD_TIMEOUT, pu32ErrStatus);
    if (LL_OK == i32Ret) {
        i32Ret = LL_ERR;
        /* Fetch has received a response. */
        (void)SDIOC_GetResponse(SDIOCx, SDIOC_RESP_REG_BIT0_31, &u32RespVal);
        if (0UL == (u32RespVal & (SDMMC_R6_GEN_UNKNOWN_ERR | SDMMC_R6_ILLEGAL_CMD | SDMMC_R6_COM_CRC_FAIL))) {
            i32Ret = LL_OK;
            *pu16RCA = (uint16_t)(u32RespVal >> 16U);
        } else if (SDMMC_R6_GEN_UNKNOWN_ERR == (u32RespVal & SDMMC_R6_GEN_UNKNOWN_ERR)) {
            *pu32ErrStatus = SDMMC_ERR_GENERAL_UNKNOWN_ERR;
        } else if (SDMMC_R6_ILLEGAL_CMD == (u32RespVal & SDMMC_R6_ILLEGAL_CMD)) {
            *pu32ErrStatus = SDMMC_ERR_ILLEGAL_CMD;
        } else {
            *pu32ErrStatus = SDMMC_ERR_COM_CRC_FAILED;
        }
    }

    return i32Ret;
}

/**
 * @brief  Checks for error conditions for R7 response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: The response is normal received
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
static int32_t SDMMC_GetCmdResp7(CM_SDIOC_TypeDef *SDIOCx, uint32_t *pu32ErrStatus)
{
    return SDMMC_WaitResponse(SDIOCx, (SDIOC_INT_FLAG_CC  | SDIOC_INT_FLAG_CIE | SDIOC_INT_FLAG_CEBE |
                                       SDIOC_INT_FLAG_CCE | SDIOC_INT_FLAG_CTOE), SDMMC_CMD_TIMEOUT, pu32ErrStatus);
}

/**
 * @brief  De-Initialize SDIOC.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @retval int32_t:
 *           - LL_OK: SDIOC De-Initialize success
 *           - LL_ERR_TIMEOUT: Software reset timeout
 */
int32_t SDIOC_DeInit(CM_SDIOC_TypeDef *SDIOCx)
{
    return SDIOC_SWReset(SDIOCx, SDIOC_SW_RST_ALL);
}

/**
 * @brief  Initialize SDIOC.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] pstcSdiocInit           Pointer to a @ref stc_sdioc_init_t structure
 * @retval int32_t:
 *           - LL_OK: SDIOC Initialize success
 *           - LL_ERR_INVD_PARAM: pstcSdiocInit == NULL
 */
int32_t SDIOC_Init(CM_SDIOC_TypeDef *SDIOCx, const stc_sdioc_init_t *pstcSdiocInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcSdiocInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
        DDL_ASSERT(IS_SDIOC_MD(pstcSdiocInit->u32Mode));
        DDL_ASSERT(IS_SDIOC_CARD_DETECT_WAY(pstcSdiocInit->u8CardDetect));
        DDL_ASSERT(IS_SDIOC_SPEED_MD(pstcSdiocInit->u8SpeedMode));
        DDL_ASSERT(IS_SDIOC_BUS_WIDTH(pstcSdiocInit->u8BusWidth));
        DDL_ASSERT(IS_SDIOC_CLK_DIV(pstcSdiocInit->u16ClockDiv));

        /* Set the SDIOC mode */
        if (CM_SDIOC1 == SDIOCx) {
            WRITE_REG32(bCM_PERIC->SDIOC_SYCTLREG_b.SELMMC1, pstcSdiocInit->u32Mode);
        } else {
            WRITE_REG32(bCM_PERIC->SDIOC_SYCTLREG_b.SELMMC2, pstcSdiocInit->u32Mode);
        }
        /* Set the SDIOC clock control value */
        WRITE_REG16(SDIOCx->CLKCON, (pstcSdiocInit->u16ClockDiv | SDIOC_CLKCON_ICE | SDIOC_CLKCON_CE));
        /* Set the SDIOC host control value */
        WRITE_REG8(SDIOCx->HOSTCON, (pstcSdiocInit->u8CardDetect | pstcSdiocInit->u8BusWidth |
                                     pstcSdiocInit->u8SpeedMode));
        /* Enable normal interrupt status */
        WRITE_REG16(SDIOCx->NORINTSTEN, SDIOC_NORINTSGEN_CLR_MASK);
        /* Enable error interrupt status */
        WRITE_REG16(SDIOCx->ERRINTSTEN, SDIOC_ERRINTSGEN_CLR_MASK);
    }

    return i32Ret;
}

/**
 * @brief  Set the fields of structure stc_sdioc_init_t to default values.
 * @param  [out] pstcSdiocInit          Pointer to a @ref stc_sdioc_init_t structure
 * @retval int32_t:
 *           - LL_OK: Structure Initialize success
 *           - LL_ERR_INVD_PARAM: pstcSdiocInit == NULL
 */
int32_t SDIOC_StructInit(stc_sdioc_init_t *pstcSdiocInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcSdiocInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        pstcSdiocInit->u32Mode      = SDIOC_MD_SD;
        pstcSdiocInit->u8CardDetect = SDIOC_CARD_DETECT_CD_PIN_LVL;
        pstcSdiocInit->u8SpeedMode  = SDIOC_SPEED_MD_NORMAL;
        pstcSdiocInit->u8BusWidth   = SDIOC_BUS_WIDTH_1BIT;
        pstcSdiocInit->u16ClockDiv  = SDIOC_CLK_DIV1;
    }

    return i32Ret;
}

/**
 * @brief  Set software reset.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u8Type                  Software reset type
 *         This parameter can be one of the following values:
 *           @arg SDIOC_SW_RST_DATA_LINE:   Only part of data circuit is reset
 *           @arg SDIOC_SW_RST_CMD_LINE:    Only part of command circuit is reset
 *           @arg SDIOC_SW_RST_ALL:         Reset the entire Host Controller except for the card detection circuit
 * @retval int32_t:
 *           - LL_OK: Software reset success
 *           - LL_ERR_TIMEOUT: Software reset timeout
 */
int32_t SDIOC_SWReset(CM_SDIOC_TypeDef *SDIOCx, uint8_t u8Type)
{
    int32_t i32Ret = LL_OK;
    __IO uint32_t u32Count;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_SW_RST_TYPE(u8Type));

    WRITE_REG8(SDIOCx->SFTRST, u8Type);
    /* Wait for reset finish */
    u32Count = SDIOC_SW_RST_TIMEOUT * (HCLK_VALUE / 20000UL);
    while (0U != READ_REG8_BIT(SDIOCx->SFTRST, u8Type)) {
        if (0UL == u32Count) {
            i32Ret = LL_ERR_TIMEOUT;
            break;
        }
        u32Count--;
    }

    return i32Ret;
}

/**
 * @brief  Enable or disable power.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void SDIOC_PowerCmd(CM_SDIOC_TypeDef *SDIOCx, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (DISABLE != enNewState) {
        SET_REG8_BIT(SDIOCx->PWRCON, SDIOC_PWRCON_PWON);
    } else {
        CLR_REG8_BIT(SDIOCx->PWRCON, SDIOC_PWRCON_PWON);
    }
}

/**
 * @brief  Get power state.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @retval An @ref en_functional_state_t enumeration value.
 *           - DISABLE: Power off or SDIOCx == NULL
 *           - ENABLE: Power on
 */
en_functional_state_t SDIOC_GetPowerState(const CM_SDIOC_TypeDef *SDIOCx)
{
    en_functional_state_t enPowerSta = DISABLE;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));

    if (0U != (READ_REG8_BIT(SDIOCx->PWRCON, SDIOC_PWRCON_PWON))) {
        enPowerSta = ENABLE;
    }

    return enPowerSta;
}

/**
 * @brief  Get SDIOC work mode.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @retval uint32_t value:
 *           - SDIOC_MD_SD:   SDIOCx selects SD mode
 *           - SDIOC_MD_MMC:  SDIOCx selects MMC mode
 */
uint32_t SDIOC_GetMode(const CM_SDIOC_TypeDef *SDIOCx)
{
    uint32_t u32SdMode;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));

