RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_sdioc.c
    u32SdMode = READ_REG32_BIT(CM_PERIC->SDIOC_SYCTLREG, ((CM_SDIOC1 == SDIOCx) ?
                               PERIC_SDIOC_SYCTLREG_SELMMC1 : PERIC_SDIOC_SYCTLREG_SELMMC2));
    if (0UL != u32SdMode) { /* MMC mode */
        u32SdMode = SDIOC_MD_MMC;
    } else {
        u32SdMode = SDIOC_MD_SD;
    }

    return u32SdMode;
}

/**
 * @brief  Enable or disable clock output.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void SDIOC_ClockCmd(CM_SDIOC_TypeDef *SDIOCx, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (DISABLE != enNewState) {
        SET_REG8_BIT(SDIOCx->CLKCON, SDIOC_CLKCON_CE);
    } else {
        CLR_REG8_BIT(SDIOCx->CLKCON, SDIOC_CLKCON_CE);
    }
}

/**
 * @brief  Set clock division.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u16Div                  Clock division
 *         This parameter can be one of the following values:
 *           @arg SDIOC_CLK_DIV1:       CLK1/1
 *           @arg SDIOC_CLK_DIV2:       CLK1/2
 *           @arg SDIOC_CLK_DIV4:       CLK1/4
 *           @arg SDIOC_CLK_DIV8:       CLK1/8
 *           @arg SDIOC_CLK_DIV16:      CLK1/16
 *           @arg SDIOC_CLK_DIV32:      CLK1/32
 *           @arg SDIOC_CLK_DIV64:      CLK1/64
 *           @arg SDIOC_CLK_DIV128:     CLK1/128
 *           @arg SDIOC_CLK_DIV256:     CLK1/256
 * @retval None
 */
void SDIOC_SetClockDiv(CM_SDIOC_TypeDef *SDIOCx, uint16_t u16Div)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_CLK_DIV(u16Div));

    MODIFY_REG16(SDIOCx->CLKCON, SDIOC_CLKCON_FS, u16Div);
}

/**
 * @brief  Find the most suitable clock division for the set clock frequency.
 * @note   More clock values can be set as needed, but the maximum cannot exceed 50MHz.
 * @param  [in] u32ClockFreq            SDIOCx_CK clock frequency
 *         This parameter can be one of the following values:
 *           @arg SDIOC_OUTPUT_CLK_FREQ_400K:   SDIOC clock: 400KHz
 *           @arg SDIOC_OUTPUT_CLK_FREQ_25M:    SDIOC clock: 25MHz
 *           @arg SDIOC_OUTPUT_CLK_FREQ_26M:    SDIOC clock: 26MHz
 *           @arg SDIOC_OUTPUT_CLK_FREQ_50M:    SDIOC clock: 50MHz
 *           @arg SDIOC_OUTPUT_CLK_FREQ_52M:    SDIOC clock: 52MHz
 *           @arg Any other value
 * @param  [out] pu16Div                Pointer to a value of clock division
 * @retval int32_t:
 *           - LL_OK: SDIOC Initialize success
 *           - LL_ERR: The Bus clock frequency is too high
 *           - LL_ERR_INVD_PARAM: pu16Div == NULL or 0UL == u32ClockFreq
 */
int32_t SDIOC_GetOptimumClockDiv(uint32_t u32ClockFreq, uint16_t *pu16Div)
{
    int32_t i32Ret = LL_OK;
    uint32_t u32BusClock;
    uint32_t u32ClockDiv;
    uint32_t u32Temp;

    if ((NULL == pu16Div) || (0UL == u32ClockFreq)) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Get BUS frequency */
        u32BusClock = SystemCoreClock / (0x01UL << (READ_REG32_BIT(CM_CMU->SCFGR, CMU_SCFGR_EXCKS) >> CMU_SCFGR_EXCKS_POS));
        u32ClockDiv = u32BusClock / u32ClockFreq;
        if (0UL != (u32BusClock % u32ClockFreq)) {
            u32ClockDiv++;
        }
        /* Check the effectiveness of clock division */
        if (u32ClockDiv > 256U) { /* Maximum division is 256 */
            i32Ret = LL_ERR;
        } else {
            if (1U == u32ClockDiv) {
                *pu16Div = SDIOC_CLK_DIV1;
            } else {
                for (u32Temp = SDIOC_CLK_DIV2; u32Temp <= SDIOC_CLK_DIV256; u32Temp <<= 1U) {
                    if (u32ClockDiv <= (u32Temp >> (SDIOC_CLKCON_FS_POS - 1U))) {
                        break;
                    }
                }
                *pu16Div = (uint16_t)u32Temp;
            }
        }
    }

    return i32Ret;
}

/**
 * @brief  Verify the validity of the clock division.
 * @param  [in] u32Mode                 SDIOC work mode
 *         This parameter can be one of the following values:
 *           @arg SDIOC_MD_SD:          SDIOCx selects SD mode
 *           @arg SDIOC_MD_MMC:         SDIOCx selects MMC mode
 * @param  [in] u8SpeedMode             Speed mode
 *         This parameter can be one of the following values:
 *           @arg SDIOC_SPEED_MD_NORMAL:    Normal speed mode
 *           @arg SDIOC_SPEED_MD_HIGH:      High speed mode
 * @param  [in] u16ClockDiv             Clock division
 *         This parameter can be one of the following values:
 *           @arg SDIOC_CLK_DIV1:       CLK1/1
 *           @arg SDIOC_CLK_DIV2:       CLK1/2
 *           @arg SDIOC_CLK_DIV4:       CLK1/4
 *           @arg SDIOC_CLK_DIV8:       CLK1/8
 *           @arg SDIOC_CLK_DIV16:      CLK1/16
 *           @arg SDIOC_CLK_DIV32:      CLK1/32
 *           @arg SDIOC_CLK_DIV64:      CLK1/64
 *           @arg SDIOC_CLK_DIV128:     CLK1/128
 *           @arg SDIOC_CLK_DIV256:     CLK1/256
 * @retval int32_t:
 *           - LL_OK: The clock division is valid
 *           - LL_ERR: The Bus clock frequency is too high
 */
int32_t SDIOC_VerifyClockDiv(uint32_t u32Mode, uint8_t u8SpeedMode, uint16_t u16ClockDiv)
{
    int32_t i32Ret = LL_OK;
    uint32_t u32BusClock;
    uint32_t u32ClockFreq;
    uint32_t u32MaxFreq;
    uint32_t u32DivValue;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_MD(u32Mode));
    DDL_ASSERT(IS_SDIOC_SPEED_MD(u8SpeedMode));
    DDL_ASSERT(IS_SDIOC_CLK_DIV(u16ClockDiv));

    /* Get Bus frequency */
    u32BusClock = SystemCoreClock / (0x01UL << (READ_REG32_BIT(CM_CMU->SCFGR, CMU_SCFGR_EXCKS) >> CMU_SCFGR_EXCKS_POS));
    u32DivValue = ((uint32_t)u16ClockDiv >> (SDIOC_CLKCON_FS_POS - 1U));
    if (0UL == u32DivValue) {
        u32ClockFreq = u32BusClock;
    } else {
        u32ClockFreq = u32BusClock / u32DivValue;
    }

    if (SDIOC_SPEED_MD_NORMAL == u8SpeedMode) {
        if (SDIOC_MD_SD != u32Mode) { /* MMC mode */
            u32MaxFreq = SDIOC_OUTPUT_CLK_FREQ_26M;
        } else {
            u32MaxFreq = SDIOC_OUTPUT_CLK_FREQ_25M;
        }
    } else {
        if (SDIOC_MD_SD != u32Mode) { /* MMC mode */
            u32MaxFreq = SDIOC_OUTPUT_CLK_FREQ_52M;
        } else {
            u32MaxFreq = SDIOC_OUTPUT_CLK_FREQ_50M;
        }
    }
    if (u32ClockFreq > u32MaxFreq) {
        i32Ret = LL_ERR;
    }

    return i32Ret;
}

/**
 * @brief  Get device insert status.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t SDIOC_GetInsertStatus(const CM_SDIOC_TypeDef *SDIOCx)
{
    en_flag_status_t enFlagSta = RESET;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));

    if (0UL != (READ_REG32_BIT(SDIOCx->PSTAT, SDIOC_PSTAT_CSS))) {
        if (0UL != (READ_REG32_BIT(SDIOCx->PSTAT, SDIOC_PSTAT_CIN))) {
            enFlagSta = SET;
        }
    }

