RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_sdioc.c
    return enFlagSta;
}

/**
 * @brief  Set speed mode.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u8SpeedMode             Speed mode
 *         This parameter can be one of the following values:
 *           @arg SDIOC_SPEED_MD_NORMAL:    Normal speed mode
 *           @arg SDIOC_SPEED_MD_HIGH:      High speed mode
 * @retval None
 */
void SDIOC_SetSpeedMode(CM_SDIOC_TypeDef *SDIOCx, uint8_t u8SpeedMode)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_SPEED_MD(u8SpeedMode));

    if (SDIOC_SPEED_MD_NORMAL != u8SpeedMode) {
        SET_REG8_BIT(SDIOCx->HOSTCON, SDIOC_HOSTCON_HSEN);
    } else {
        CLR_REG8_BIT(SDIOCx->HOSTCON, SDIOC_HOSTCON_HSEN);
    }
}

/**
 * @brief  Set bus width.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u8BusWidth              Bus width
 *         This parameter can be one of the following values:
 *           @arg SDIOC_BUS_WIDTH_1BIT: The Bus width is 1 bit
 *           @arg SDIOC_BUS_WIDTH_4BIT: The Bus width is 4 bit
 *           @arg SDIOC_BUS_WIDTH_8BIT: The Bus width is 8 bit
 * @retval None
 */
void SDIOC_SetBusWidth(CM_SDIOC_TypeDef *SDIOCx, uint8_t u8BusWidth)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_BUS_WIDTH(u8BusWidth));

    MODIFY_REG8(SDIOCx->HOSTCON, (SDIOC_HOSTCON_DW | SDIOC_HOSTCON_EXDW), u8BusWidth);
}

/**
 * @brief  Set card detect line select.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u8Src                   Card detect source
 *         This parameter can be one of the following values:
 *           @arg SDIOC_CARD_DETECT_CD_PIN_LVL:     SDIOCx_CD(x=1~2) line is selected (for normal use)
 *           @arg SDIOC_CARD_DETECT_TEST_SIGNAL:    The Card Detect Test Level is selected(for test purpose)
 * @retval None
 */
void SDIOC_SetCardDetectSrc(CM_SDIOC_TypeDef *SDIOCx, uint8_t u8Src)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_CARD_DETECT_WAY(u8Src));

    if (SDIOC_CARD_DETECT_CD_PIN_LVL != u8Src) {
        SET_REG8_BIT(SDIOCx->HOSTCON, SDIOC_HOSTCON_CDSS);
    } else {
        CLR_REG8_BIT(SDIOCx->HOSTCON, SDIOC_HOSTCON_CDSS);
    }
}

/**
 * @brief  Set card detect test level.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u8Level                 Card test level
 *         This parameter can be one of the following values:
 *           @arg SDIOC_CARD_DETECT_TEST_LVL_LOW:   Card identification test signal is low level (with device insertion)
 *           @arg SDIOC_CARD_DETECT_TEST_LVL_HIGH:  Card identification test signal is high level (no device insertion)
 * @retval None
 */
void SDIOC_SetCardDetectTestLevel(CM_SDIOC_TypeDef *SDIOCx, uint8_t u8Level)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_CARD_DETECT_TEST_LEVEL(u8Level));

    if (SDIOC_CARD_DETECT_TEST_LVL_LOW != u8Level) {
        SET_REG8_BIT(SDIOCx->HOSTCON, SDIOC_HOSTCON_CDTL);
    } else {
        CLR_REG8_BIT(SDIOCx->HOSTCON, SDIOC_HOSTCON_CDTL);
    }
}

/**
 * @brief  Configure the SDIOCx command parameters.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] pstcCmdConfig           Pointer to a @ref stc_sdioc_cmd_config_t structure
 * @retval int32_t:
 *           - LL_OK: Configure SDIOCx command parameters success
 *           - LL_ERR_INVD_PARAM: pstcCmdConfig == NULL
 */
int32_t SDIOC_SendCommand(CM_SDIOC_TypeDef *SDIOCx, const stc_sdioc_cmd_config_t *pstcCmdConfig)
{
    int32_t i32Ret = LL_OK;
    __IO uint32_t *pu32Temp;

    if (NULL == pstcCmdConfig) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
        DDL_ASSERT(IS_SDIOC_CMD_INDEX(pstcCmdConfig->u16CmdIndex));
        DDL_ASSERT(IS_SDIOC_CMD_TYPE(pstcCmdConfig->u16CmdType));
        DDL_ASSERT(IS_SDIOC_DATA_LINE(pstcCmdConfig->u16DataLine));
        DDL_ASSERT(IS_SDIOC_RESP_TYPE(pstcCmdConfig->u16ResponseType));

        /* Set the SDIOC Command parameters value */
        pu32Temp = SDIOC_ARG_ADDR(SDIOCx);
        WRITE_REG32(*pu32Temp, pstcCmdConfig->u32Argument);
        /* Set the SDIOC Command controller value */
        WRITE_REG16(SDIOCx->CMD, ((uint16_t)(pstcCmdConfig->u16CmdIndex << SDIOC_CMD_IDX_POS) |
                                  pstcCmdConfig->u16CmdType | pstcCmdConfig->u16DataLine |
                                  pstcCmdConfig->u16ResponseType));
    }

    return i32Ret;
}

/**
 * @brief  Set the fields of structure stc_sdioc_cmd_config_t to default values.
 * @param  [out] pstcCmdConfig          Pointer to a @ref stc_sdioc_cmd_config_t structure
 * @retval int32_t:
 *           - LL_OK: Structure Initialize success
 *           - LL_ERR_INVD_PARAM: pstcDataConfig == NULL
 */
int32_t SDIOC_CommandStructInit(stc_sdioc_cmd_config_t *pstcCmdConfig)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcCmdConfig) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        pstcCmdConfig->u32Argument      = 0U;
        pstcCmdConfig->u16CmdIndex      = 0U;
        pstcCmdConfig->u16CmdType       = SDIOC_CMD_TYPE_NORMAL;
        pstcCmdConfig->u16DataLine      = SDIOC_DATA_LINE_DISABLE;
        pstcCmdConfig->u16ResponseType  = SDIOC_RESP_TYPE_NO;
    }

    return i32Ret;
}

/**
 * @brief  Get the response received from the card for the last command
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u8Reg                   SDIOC response register
 *         This parameter can be one of the following values:
 *           @arg SDIOC_RESP_REG_BIT0_31:   Command Response Register 0-31bit
 *           @arg SDIOC_RESP_REG_BIT32_63:  Command Response Register 32-63bit
 *           @arg SDIOC_RESP_REG_BIT64_95:  Command Response Register 64-95bit
 *           @arg SDIOC_RESP_REG_BIT96_127: Command Response Register 96-127bit
 * @param  [out] pu32Value              Pointer to a Response value
 * @retval int32_t:
 *           - LL_OK: Get response success
 *           - LL_ERR_INVD_PARAM: pu32Value == NULL
 */
int32_t SDIOC_GetResponse(CM_SDIOC_TypeDef *SDIOCx, uint8_t u8Reg, uint32_t *pu32Value)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pu32Value) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
        DDL_ASSERT(IS_SDIOC_RESP_REG(u8Reg));

        *pu32Value = READ_REG32(*SDIOC_RESP_ADDR(SDIOCx, u8Reg));
    }

    return i32Ret;
}

/**
 * @brief  Configure the SDIOCx data parameters.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] pstcDataConfig          Pointer to a @ref stc_sdioc_data_config_t structure
 * @retval int32_t:
 *           - LL_OK: Configure SDIOCx data parameters success
 *           - LL_ERR_INVD_PARAM: pstcDataConfig == NULL
 */
int32_t SDIOC_ConfigData(CM_SDIOC_TypeDef *SDIOCx, const stc_sdioc_data_config_t *pstcDataConfig)
{
    int32_t i32Ret = LL_OK;
    uint16_t u16BlkCnt;

