RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_sdioc.c
    if (NULL == pstcDataConfig) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
        DDL_ASSERT(IS_SDIOC_BLOCK_SIZE(pstcDataConfig->u16BlockSize));
        DDL_ASSERT(IS_SDIOC_TRANS_DIR(pstcDataConfig->u16TransDir));
        DDL_ASSERT(IS_SDIOC_AUTO_SEND_CMD12(pstcDataConfig->u16AutoCmd12));
        DDL_ASSERT(IS_SDIOC_TRANS_MD(pstcDataConfig->u16TransMode));
        DDL_ASSERT(IS_SDIOC_DATA_TIMEOUT_TIME(pstcDataConfig->u16DataTimeout));

        if (SDIOC_TRANS_MD_STOP_MULTI == pstcDataConfig->u16TransMode) {
            u16BlkCnt = 0U;
        } else {
            u16BlkCnt = pstcDataConfig->u16BlockCount;
        }
        /* Set the SDIOC Data Transfer Timeout value */
        WRITE_REG8(SDIOCx->TOUTCON, pstcDataConfig->u16DataTimeout);
        /* Set the SDIOC Block Count value */
        WRITE_REG16(SDIOCx->BLKSIZE, pstcDataConfig->u16BlockSize);
        /* Set the SDIOC Block Size value */
        WRITE_REG16(SDIOCx->BLKCNT, u16BlkCnt);
        /* Set the SDIOC Data Transfer Mode */
        WRITE_REG16(SDIOCx->TRANSMODE, ((pstcDataConfig->u16TransDir | pstcDataConfig->u16AutoCmd12 |
                                         pstcDataConfig->u16TransMode) & 0xFFU));
    }

    return i32Ret;
}

/**
 * @brief  Set the fields of structure stc_sdioc_data_config_t to default values.
 * @param  [out] pstcDataConfig         Pointer to a @ref stc_sdioc_data_config_t structure
 * @retval int32_t:
 *           - LL_OK: Structure Initialize success
 *           - LL_ERR_INVD_PARAM: pstcDataConfig == NULL
 */
int32_t SDIOC_DataStructInit(stc_sdioc_data_config_t *pstcDataConfig)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcDataConfig) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        pstcDataConfig->u16BlockSize    = 512U;
        pstcDataConfig->u16BlockCount   = 0U;
        pstcDataConfig->u16TransDir     = SDIOC_TRANS_DIR_TO_CARD;
        pstcDataConfig->u16AutoCmd12    = SDIOC_AUTO_SEND_CMD12_DISABLE;
        pstcDataConfig->u16TransMode    = SDIOC_TRANS_MD_SINGLE;
        pstcDataConfig->u16DataTimeout  = SDIOC_DATA_TIMEOUT_CLK_2E13;
    }

    return i32Ret;
}

/**
 * @brief  Read data from SDIOC FIFO.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [out] au8Data                Pointer to the buffer
 * @param  [in] u32Len                  Data length
 * @retval int32_t:
 *           - LL_OK: Read data success
 *           - LL_ERR_INVD_PARAM: NULL == au8Data or (u32Len % 4U) != 0
 */
int32_t SDIOC_ReadBuffer(CM_SDIOC_TypeDef *SDIOCx, uint8_t au8Data[], uint32_t u32Len)
{
    int32_t i32Ret = LL_OK;
    uint32_t i;
    uint32_t u32Temp;
    __IO uint32_t *BUF_REG;

    if ((NULL == au8Data) || (0U != (u32Len % 4U))) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));

        BUF_REG = SDIOC_BUF_ADDR(SDIOCx);
        for (i = 0U; i < u32Len; i += 4U) {
            u32Temp = READ_REG32(*BUF_REG);
            au8Data[i]      = (uint8_t)(u32Temp & 0xFFUL);
            au8Data[i + 1U] = (uint8_t)((u32Temp >> 8U) & 0xFFUL);
            au8Data[i + 2U] = (uint8_t)((u32Temp >> 16U) & 0xFFUL);
            au8Data[i + 3U] = (uint8_t)((u32Temp >> 24U) & 0xFFUL);
        }
    }

    return i32Ret;
}

/**
 * @brief  Write data to SDIOC FIFO.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] au8Data                 Pointer to the buffer
 * @param  [in] u32Len                  Data length
 * @retval int32_t:
 *           - LL_OK: Write data success
 *           - LL_ERR_INVD_PARAM: NULL == au8Data or (u32Len % 4U) != 0
 */
int32_t SDIOC_WriteBuffer(CM_SDIOC_TypeDef *SDIOCx, const uint8_t au8Data[], uint32_t u32Len)
{
    int32_t i32Ret = LL_OK;
    uint32_t i;
    uint32_t u32Temp;
    __IO uint32_t *BUF_REG;

    if ((NULL == au8Data) || (0U != (u32Len % 4U))) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));

        BUF_REG = SDIOC_BUF_ADDR(SDIOCx);
        for (i = 0U; i < u32Len; i += 4U) {
            u32Temp = ((uint32_t)au8Data[i + 3U] << 24U) | ((uint32_t)au8Data[i + 2U] << 16U) |
                      ((uint32_t)au8Data[i + 1U] << 8U)  | au8Data[i];
            WRITE_REG32(*BUF_REG, u32Temp);
        }
    }

    return i32Ret;
}

/**
 * @brief  Enable or disable block gap stop.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void SDIOC_BlockGapStopCmd(CM_SDIOC_TypeDef *SDIOCx, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (DISABLE != enNewState) {
        SET_REG8_BIT(SDIOCx->BLKGPCON, SDIOC_BLKGPCON_SABGR);
    } else {
        CLR_REG8_BIT(SDIOCx->BLKGPCON, SDIOC_BLKGPCON_SABGR);
    }
}

/**
 * @brief  Restart data transfer.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @retval None
 */
void SDIOC_RestartTrans(CM_SDIOC_TypeDef *SDIOCx)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));

    SET_REG8_BIT(SDIOCx->BLKGPCON, SDIOC_BLKGPCON_CR);
}

/**
 * @brief  Enable or disable read wait.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void SDIOC_ReadWaitCmd(CM_SDIOC_TypeDef *SDIOCx, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (DISABLE != enNewState) {
        SET_REG8_BIT(SDIOCx->BLKGPCON, SDIOC_BLKGPCON_RWC);
    } else {
        CLR_REG8_BIT(SDIOCx->BLKGPCON, SDIOC_BLKGPCON_RWC);
    }
}

/**
 * @brief  Enable or disable data block gap interrupt.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void SDIOC_BlockGapIntCmd(CM_SDIOC_TypeDef *SDIOCx, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (DISABLE != enNewState) {
        SET_REG8_BIT(SDIOCx->BLKGPCON, SDIOC_BLKGPCON_IABG);
    } else {
        CLR_REG8_BIT(SDIOCx->BLKGPCON, SDIOC_BLKGPCON_IABG);
    }
}

/**
 * @brief  Enable or disable interrupt.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32IntType              Normal and error interrupts source
 *         This parameter can be one or any combination of the following values:
 *           @arg SDIOC_INT_CINTSEN:    Card interrupt
 *           @arg SDIOC_INT_CRMSEN:     Card Removal interrupt
 *           @arg SDIOC_INT_CISTSEN:    Card Insertion interrupt
 *           @arg SDIOC_INT_BRRSEN:     Buffer Read Ready interrupt
 *           @arg SDIOC_INT_BWRSEN:     Buffer Write Ready interrupt
 *           @arg SDIOC_INT_BGESEN:     Block Gap Event interrupt
 *           @arg SDIOC_INT_TCSEN:      Transfer Complete interrupt
 *           @arg SDIOC_INT_CCSEN:      Command Complete interrupt
 *           @arg SDIOC_INT_ACESEN:     Auto CMD12 error interrupt
 *           @arg SDIOC_INT_DEBESEN:    Data End Bit error interrupt
 *           @arg SDIOC_INT_DCESEN:     Data CRC error interrupt
 *           @arg SDIOC_INT_DTOESEN:    Data Timeout error interrupt
 *           @arg SDIOC_INT_CIESEN:     Command Index error interrupt
 *           @arg SDIOC_INT_CEBESEN:    Command End Bit error interrupt
 *           @arg SDIOC_INT_CCESEN:     Command CRC error interrupt
 *           @arg SDIOC_INT_CTOESEN:    Command Timeout error interrupt
 *           @arg SDIOC_INT_ALL:        All of the above
 *           @arg SDIOC_NORMAL_INT_ALL: All of the normal interrupt
 *           @arg SDIOC_ERR_INT_ALL:    All of the error interrupt
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void SDIOC_IntCmd(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32IntType, en_functional_state_t enNewState)
{
    uint16_t u16NormalInt;
    uint16_t u16ErrorInt;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_INT(u32IntType));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u16NormalInt = (uint16_t)(u32IntType & 0xFFFFU);
    u16ErrorInt  = (uint16_t)(u32IntType >> 16U);
    if (DISABLE != enNewState) {
        if (0U != u16NormalInt) {
            SET_REG16_BIT(SDIOCx->NORINTSGEN, u16NormalInt);
        }
        if (0U != u16ErrorInt) {
            SET_REG16_BIT(SDIOCx->ERRINTSGEN, u16ErrorInt);
        }
    } else {
        if (0U != u16NormalInt) {
            CLR_REG16_BIT(SDIOCx->NORINTSGEN, u16NormalInt);
        }
        if (0U != u16ErrorInt) {
            CLR_REG16_BIT(SDIOCx->ERRINTSGEN, u16ErrorInt);
        }
    }
}

/**
 * @brief  Get interrupt enable state.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32IntType              Normal and error interrupts source
 *         This parameter can be one or any combination of the following values:
 *           @arg SDIOC_INT_CINTSEN:    Card interrupt
 *           @arg SDIOC_INT_CRMSEN:     Card Removal interrupt
 *           @arg SDIOC_INT_CISTSEN:    Card Insertion interrupt
 *           @arg SDIOC_INT_BRRSEN:     Buffer Read Ready interrupt
 *           @arg SDIOC_INT_BWRSEN:     Buffer Write Ready interrupt
 *           @arg SDIOC_INT_BGESEN:     Block Gap Event interrupt
 *           @arg SDIOC_INT_TCSEN:      Transfer Complete interrupt
 *           @arg SDIOC_INT_CCSEN:      Command Complete interrupt
 *           @arg SDIOC_INT_ACESEN:     Auto CMD12 error interrupt
 *           @arg SDIOC_INT_DEBESEN:    Data End Bit error interrupt
 *           @arg SDIOC_INT_DCESEN:     Data CRC error interrupt
 *           @arg SDIOC_INT_DTOESEN:    Data Timeout error interrupt
 *           @arg SDIOC_INT_CIESEN:     Command Index error interrupt
 *           @arg SDIOC_INT_CEBESEN:    Command End Bit error interrupt
 *           @arg SDIOC_INT_CCESEN:     Command CRC error interrupt
 *           @arg SDIOC_INT_CTOESEN:    Command Timeout error interrupt
 *           @arg SDIOC_INT_ALL:        All of the above
 *           @arg SDIOC_NORMAL_INT_ALL: All of the normal interrupt
 *           @arg SDIOC_ERR_INT_ALL:    All of the error interrupt
 * @retval An @ref en_functional_state_t enumeration value.
 *           - ENABLE: The interrupt is enable
 *           - DISABLE: The interrupt is disable
 */
en_functional_state_t SDIOC_GetIntEnableState(const CM_SDIOC_TypeDef *SDIOCx, uint32_t u32IntType)
{
    uint16_t u16NormalInt;
    uint16_t u16ErrorInt;
    en_functional_state_t enIntSta = DISABLE;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_INT(u32IntType));

    u16NormalInt = (uint16_t)(u32IntType & 0xFFFFU);
    u16ErrorInt  = (uint16_t)(u32IntType >> 16U);
    if (0U != u16NormalInt) {
        if (0U != (READ_REG16_BIT(SDIOCx->NORINTSGEN, u16NormalInt))) {
            enIntSta = ENABLE;
        }
    }
    if ((0U != u16ErrorInt) && (enIntSta != ENABLE)) {
        if (0U != (READ_REG16_BIT(SDIOCx->ERRINTSGEN, u16ErrorInt))) {
            enIntSta = ENABLE;
        }
    }

