RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_sdioc.c
    return enIntSta;
}

/**
 * @brief  Get interrupt flag status.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32Flag                 Normal and error interrupts flag
 *         This parameter can be one or any combination the following values:
 *           @arg SDIOC_INT_FLAG_EI:    Error interrupt flag
 *           @arg SDIOC_INT_FLAG_CINT:  Card interrupt flag
 *           @arg SDIOC_INT_FLAG_CRM:   Card Removal flag
 *           @arg SDIOC_INT_FLAG_CIST:  Card Insertion flag
 *           @arg SDIOC_INT_FLAG_BRR:   Buffer Read Ready flag
 *           @arg SDIOC_INT_FLAG_BWR:   Buffer Write Ready flag
 *           @arg SDIOC_INT_FLAG_BGE:   Block Gap Event flag
 *           @arg SDIOC_INT_FLAG_TC:    Transfer Complete flag
 *           @arg SDIOC_INT_FLAG_CC:    Command Complete flag
 *           @arg SDIOC_INT_FLAG_ACE:   Auto CMD12 error flag
 *           @arg SDIOC_INT_FLAG_DEBE:  Data End Bit error flag
 *           @arg SDIOC_INT_FLAG_DCE:   Data CRC error flag
 *           @arg SDIOC_INT_FLAG_DTOE:  Data Timeout error flag
 *           @arg SDIOC_INT_FLAG_CIE:   Command Index error flag
 *           @arg SDIOC_INT_FLAG_CEBE:  Command End Bit error flag
 *           @arg SDIOC_INT_FLAG_CCE:   Command CRC error flag
 *           @arg SDIOC_INT_FLAG_CTOE:  Command Timeout error flag
 *           @arg SDIOC_INT_FLAG_ALL:           All of the above
 *           @arg SDIOC_NORMAL_INT_FLAG_ALL:    All of the normal interrupt flag
 *           @arg SDIOC_ERR_INT_FLAG_ALL:       All of the error interrupt flag
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t SDIOC_GetIntStatus(const CM_SDIOC_TypeDef *SDIOCx, uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = RESET;
    uint16_t u16NormalFlag;
    uint16_t u16ErrorFlag;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_GET_INT_FLAG(u32Flag));

    u16NormalFlag = (uint16_t)(u32Flag & 0xFFFFU);
    u16ErrorFlag  = (uint16_t)(u32Flag >> 16U);
    if (0U != u16NormalFlag) {
        if (0U != (READ_REG16_BIT(SDIOCx->NORINTST, u16NormalFlag))) {
            enFlagSta = SET;
        }
    }
    if ((0U != u16ErrorFlag) && (enFlagSta != SET)) {
        if (0U != (READ_REG16_BIT(SDIOCx->ERRINTST, u16ErrorFlag))) {
            enFlagSta = SET;
        }
    }

    return enFlagSta;
}

/**
 * @brief  Clear interrupt flag status.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32Flag                 Normal and error interrupts flag
 *         This parameter can be one or any combination of the following values:
 *           @arg SDIOC_INT_FLAG_CRM:   Card Removal flag
 *           @arg SDIOC_INT_FLAG_CIST:  Card Insertion flag
 *           @arg SDIOC_INT_FLAG_BRR:   Buffer Read Ready flag
 *           @arg SDIOC_INT_FLAG_BWR:   Buffer Write Ready flag
 *           @arg SDIOC_INT_FLAG_BGE:   Block Gap Event flag
 *           @arg SDIOC_INT_FLAG_TC:    Transfer Complete flag
 *           @arg SDIOC_INT_FLAG_CC:    Command Complete flag
 *           @arg SDIOC_INT_FLAG_ACE:   Auto CMD12 error flag
 *           @arg SDIOC_INT_FLAG_DEBE:  Data End Bit error flag
 *           @arg SDIOC_INT_FLAG_DCE:   Data CRC error flag
 *           @arg SDIOC_INT_FLAG_DTOE:  Data Timeout error flag
 *           @arg SDIOC_INT_FLAG_CIE:   Command Index error flag
 *           @arg SDIOC_INT_FLAG_CEBE:  Command End Bit error flag
 *           @arg SDIOC_INT_FLAG_CCE:   Command CRC error flag
 *           @arg SDIOC_INT_FLAG_CTOE:  Command Timeout error flag
 *           @arg SDIOC_INT_FLAG_CLR_ALL:   All of the above
 * @retval None
 */
void SDIOC_ClearIntStatus(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32Flag)
{
    uint16_t u16NormalFlag;
    uint16_t u16ErrorFlag;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_CLR_INT_FLAG(u32Flag));

    u16NormalFlag = (uint16_t)(u32Flag & 0xFFFFU);
    u16ErrorFlag  = (uint16_t)(u32Flag >> 16U);
    if (0U != u16NormalFlag) {
        WRITE_REG16(SDIOCx->NORINTST, u16NormalFlag);
    }
    if (0U != u16ErrorFlag) {
        WRITE_REG16(SDIOCx->ERRINTST, u16ErrorFlag);
    }
}

/**
 * @brief  Enable or disable interrupt status.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32IntType              Normal and error interrupts source
 *         This parameter can be one or any combination of the following values:
 *           @arg SDIOC_INT_CINTSEN:    Card interrupt
 *           @arg SDIOC_INT_CRMSEN:     Card Removal interrupt
 *           @arg SDIOC_INT_CISTSEN:    Card Insertion interrupt
 *           @arg SDIOC_INT_BRRSEN:     Buffer Read Ready interrupt
 *           @arg SDIOC_INT_BWRSEN:     Buffer Write Ready interrupt
 *           @arg SDIOC_INT_BGESEN:     Block Gap Event interrupt
 *           @arg SDIOC_INT_TCSEN:      Transfer Complete interrupt
 *           @arg SDIOC_INT_CCSEN:      Command Complete interrupt
 *           @arg SDIOC_INT_ACESEN:     Auto CMD12 error interrupt
 *           @arg SDIOC_INT_DEBESEN:    Data End Bit error interrupt
 *           @arg SDIOC_INT_DCESEN:     Data CRC error interrupt
 *           @arg SDIOC_INT_DTOESEN:    Data Timeout error interrupt
 *           @arg SDIOC_INT_CIESEN:     Command Index error interrupt
 *           @arg SDIOC_INT_CEBESEN:    Command End Bit error interrupt
 *           @arg SDIOC_INT_CCESEN:     Command CRC error interrupt
 *           @arg SDIOC_INT_CTOESEN:    Command Timeout error interrupt
 *           @arg SDIOC_INT_ALL:        All of the above
 *           @arg SDIOC_NORMAL_INT_ALL: All of the normal interrupt
 *           @arg SDIOC_ERR_INT_ALL:    All of the error interrupt
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void SDIOC_IntStatusCmd(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32IntType, en_functional_state_t enNewState)
{
    uint16_t u16NormalInt;
    uint16_t u16ErrorInt;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_INT(u32IntType));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u16NormalInt = (uint16_t)(u32IntType & 0xFFFFU);
    u16ErrorInt  = (uint16_t)(u32IntType >> 16U);
    if (DISABLE != enNewState) {
        if (0U != u16NormalInt) {
            SET_REG16_BIT(SDIOCx->NORINTSTEN, u16NormalInt);
        }
        if (0U != u16ErrorInt) {
            SET_REG16_BIT(SDIOCx->ERRINTSTEN, u16ErrorInt);
        }
    } else {
        if (0U != u16NormalInt) {
            CLR_REG16_BIT(SDIOCx->NORINTSTEN, u16NormalInt);
        }
        if (0U != u16ErrorInt) {
            CLR_REG16_BIT(SDIOCx->ERRINTSTEN, u16ErrorInt);
        }
    }
}

/**
 * @brief  Get Host status.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32Flag                 Host flag
 *         This parameter can be one or any combination the following values:
 *           @arg SDIOC_HOST_FLAG_CMDL:     CMD Line Level flag
 *           @arg SDIOC_HOST_FLAG_DATL:     DAT[3:0] Line Level flag
 *           @arg SDIOC_HOST_FLAG_DATL_D0:  DAT[0] Line Level flag
 *           @arg SDIOC_HOST_FLAG_DATL_D1:  DAT[1] Line Level flag
 *           @arg SDIOC_HOST_FLAG_DATL_D2:  DAT[2] Line Level flag
 *           @arg SDIOC_HOST_FLAG_DATL_D3:  DAT[3] Line Level flag
 *           @arg SDIOC_HOST_FLAG_WPL:      Write Protect Line Level flag
 *           @arg SDIOC_HOST_FLAG_CDL:      Card Detect Line Level flag
 *           @arg SDIOC_HOST_FLAG_CSS:      Device Stable flag
 *           @arg SDIOC_HOST_FLAG_CIN:      Device Inserted flag
 *           @arg SDIOC_HOST_FLAG_BRE:      Data buffer full flag
 *           @arg SDIOC_HOST_FLAG_BWE:      Data buffer empty flag
 *           @arg SDIOC_HOST_FLAG_RTA:      Read operation flag
 *           @arg SDIOC_HOST_FLAG_WTA:      Write operation flag
 *           @arg SDIOC_HOST_FLAG_DA:       DAT Line transfer flag
 *           @arg SDIOC_HOST_FLAG_CID:      Command Inhibit with data flag
 *           @arg SDIOC_HOST_FLAG_CIC:      Command Inhibit flag
 *           @arg SDIOC_HOST_FLAG_ALL:      All of the above
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t SDIOC_GetHostStatus(const CM_SDIOC_TypeDef *SDIOCx, uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = RESET;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_GET_HOST_FLAG(u32Flag));

    if (0UL != (READ_REG32_BIT(SDIOCx->PSTAT, u32Flag))) {
        enFlagSta = SET;
    }

