RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_sdioc.c
    return enFlagSta;
}

/**
 * @brief  Get auto CMD12 error status.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u16Flag                 Auto CMD12 error flag
 *         This parameter can be one or any combination the following values:
 *           @arg SDIOC_AUTO_CMD_ERR_FLAG_CMDE: Command Not Issued By Auto CMD12 error flag
 *           @arg SDIOC_AUTO_CMD_ERR_FLAG_IE:   Auto CMD12 Index error flag
 *           @arg SDIOC_AUTO_CMD_ERR_FLAG_EBE:  Auto CMD12 End Bit error flag
 *           @arg SDIOC_AUTO_CMD_ERR_FLAG_CE:   Auto CMD12 CRC error flag
 *           @arg SDIOC_AUTO_CMD_ERR_FLAG_TOE:  Auto CMD12 Timeout error flag
 *           @arg SDIOC_AUTO_CMD_ERR_FLAG_NE:   Auto CMD12 Not Executed flag
 *           @arg SDIOC_AUTO_CMD_ERR_FLAG_ALL:  All of the above
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t SDIOC_GetAutoCmdErrorStatus(const CM_SDIOC_TypeDef *SDIOCx, uint16_t u16Flag)
{
    en_flag_status_t enFlagSta = RESET;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_AUTO_CMD_ERR_FLAG(u16Flag));

    if (0U != (READ_REG16_BIT(SDIOCx->ATCERRST, u16Flag))) {
        enFlagSta = SET;
    }

    return enFlagSta;
}

/**
 * @brief  Force the specified auto CMD12 error event.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u16Event                Auto CMD12 error event
 *         This parameter can be one or any combination the following values:
 *           @arg SDIOC_FORCE_AUTO_CMD_ERR_FCMDE:   Force Event for Command Not Issued By Auto CMD12 error
 *           @arg SDIOC_FORCE_AUTO_CMD_ERR_FIE:     Force Event for Auto CMD12 Index error
 *           @arg SDIOC_FORCE_AUTO_CMD_ERR_FEBE:    Force Event for Auto CMD12 End Bit error
 *           @arg SDIOC_FORCE_AUTO_CMD_ERR_FCE:     Force Event for Auto CMD12 CRC error
 *           @arg SDIOC_FORCE_AUTO_CMD_ERR_FTOE:    Force Event for Auto CMD12 Timeout error
 *           @arg SDIOC_FORCE_AUTO_CMD_ERR_FNE:     Force Event for Auto CMD12 Not Executed
 *           @arg SDIOC_FORCE_AUTO_CMD_ERR_ALL:     All of the above
 * @retval None
 */
void SDIOC_ForceAutoCmdErrorEvent(CM_SDIOC_TypeDef *SDIOCx, uint16_t u16Event)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_FORCE_AUTO_CMD_ERR(u16Event));

    WRITE_REG16(SDIOCx->FEA, u16Event);
}

/**
 * @brief  Force the specified error interrupt event.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u16Event                Error interrupt event
 *         This parameter can be one or any combination the following values:
 *           @arg SDIOC_FORCE_ERR_INT_FACE:     Force Event for Auto CMD12 error
 *           @arg SDIOC_FORCE_ERR_INT_FDEBE:    Force Event for Data End Bit error
 *           @arg SDIOC_FORCE_ERR_INT_FDCE:     Force Event for Data CRC error
 *           @arg SDIOC_FORCE_ERR_INT_FDTOE:    Force Event for Data Timeout error
 *           @arg SDIOC_FORCE_ERR_INT_FCIE:     Force Event for Command Index error
 *           @arg SDIOC_FORCE_ERR_INT_FCEBE:    Force Event for Command End Bit error
 *           @arg SDIOC_FORCE_ERR_INT_FCCE:     Force Event for Command CRC error
 *           @arg SDIOC_FORCE_ERR_INT_FCTOE:    Force Event for Command Timeout error
 *           @arg SDIOC_FORCE_ERR_INT_ALL:      All of the above
 * @retval None
 */
void SDIOC_ForceErrorIntEvent(CM_SDIOC_TypeDef *SDIOCx, uint16_t u16Event)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_FORCE_ERR_INT(u16Event));

    WRITE_REG16(SDIOCx->FEE, u16Event);
}

/**
 * @brief  Send the Go Idle State command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD0_GoIdleState(CM_SDIOC_TypeDef *SDIOCx, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        *pu32ErrStatus                  = SDMMC_ERR_NONE;
        stcCmdConfig.u32Argument        = 0UL;
        stcCmdConfig.u16CmdIndex        = SDIOC_CMD0_GO_IDLE_STATE;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_DISABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_NO;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdError(SDIOCx);
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the Send CID command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD2_AllSendCID(CM_SDIOC_TypeDef *SDIOCx, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = 0UL;
        stcCmdConfig.u16CmdIndex        = SDIOC_CMD2_ALL_SEND_CID;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_DISABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R2;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp2(SDIOCx, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the command for asking the card to publish a new relative address(RCA).
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [out] pu16RCA                Pointer to the new RCA value
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu16RCA == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD3_SendRelativeAddr(CM_SDIOC_TypeDef *SDIOCx, uint16_t *pu16RCA, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if ((NULL == pu16RCA) || (NULL == pu32ErrStatus)) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = 0UL;
        stcCmdConfig.u16CmdIndex        = SDIOC_CMD3_SEND_RELATIVE_ADDR;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_DISABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R1_R5_R6_R7;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp6(SDIOCx, pu16RCA, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @brief  Checks switchable function and switch card function.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32Argument             Argument used for the command.
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD6_SwitchFunc(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32Argument, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;
    uint32_t u32SdMode;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument    = u32Argument;
        stcCmdConfig.u16CmdIndex    = SDIOC_CMD6_SWITCH_FUNC;
        stcCmdConfig.u16CmdType     = SDIOC_CMD_TYPE_NORMAL;
        u32SdMode                   = SDIOC_GetMode(SDIOCx);
        if (SDIOC_MD_SD != u32SdMode) { /* MMC mode */
            stcCmdConfig.u16DataLine      = SDIOC_DATA_LINE_DISABLE;
            stcCmdConfig.u16ResponseType  = SDIOC_RESP_TYPE_R1B_R5B;
        } else {
            stcCmdConfig.u16DataLine      = SDIOC_DATA_LINE_ENABLE;
            stcCmdConfig.u16ResponseType  = SDIOC_RESP_TYPE_R1_R5_R6_R7;
        }
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            if (SDIOC_MD_SD != u32SdMode) { /* MMC mode */
                i32Ret = SDMMC_GetCmdResp1Busy(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrStatus);
            } else {
                i32Ret = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrStatus);
            }
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the Select Deselect command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32RCA                  Relative Card Address(RCA)
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD7_SelectDeselectCard(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32RCA, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = u32RCA;
        stcCmdConfig.u16CmdIndex        = SDIOC_CMD7_SELECT_DESELECT_CARD;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_DISABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R1B_R5B;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp1Busy(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the Interface Condition command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD8_SendInterfaceCond(CM_SDIOC_TypeDef *SDIOCx, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;
    uint32_t u32SdMode;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Argument: - [31:12]: Reserved (shall be set to '0')
        - [11:8]: Supply Voltage (VHS) 0x1 (Range: 2.7-3.6 V)
        - [7:0]: Check Pattern (recommended 0xAA) */
        stcCmdConfig.u32Argument        = SDMMC_CMD8_CHECK_PATTERN;
        stcCmdConfig.u16CmdIndex        = SDIOC_CMD8_SEND_IF_COND;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R1_R5_R6_R7;
        u32SdMode                       = SDIOC_GetMode(SDIOCx);
        if (SDIOC_MD_SD != u32SdMode) { /* MMC mode */
            stcCmdConfig.u16DataLine    = SDIOC_DATA_LINE_ENABLE;
        } else {
            stcCmdConfig.u16DataLine    = SDIOC_DATA_LINE_DISABLE;
        }
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            if (SDIOC_MD_SD != u32SdMode) { /* MMC mode */
                i32Ret = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrStatus);
            } else {
                i32Ret = SDMMC_GetCmdResp7(SDIOCx, pu32ErrStatus);
            }
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the Send CSD command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32RCA                  Relative Card Address(RCA)
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD9_SendCSD(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32RCA, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = u32RCA;
        stcCmdConfig.u16CmdIndex        = SDIOC_CMD9_SEND_CSD;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_DISABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R2;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp2(SDIOCx, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the Stop Transfer command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD12_StopTrans(CM_SDIOC_TypeDef *SDIOCx, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = 0UL;
        stcCmdConfig.u16CmdIndex        = SDIOC_CMD12_STOP_TRANSMISSION;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_DISABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R1B_R5B;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp1Busy(SDIOCx, SDMMC_CMD_TIMEOUT * 1000UL, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the Status command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32RCA                  Relative Card Address(RCA)
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD13_SendStatus(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32RCA, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = u32RCA;
        stcCmdConfig.u16CmdIndex        = SDIOC_CMD13_SEND_STATUS;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_DISABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R1_R5_R6_R7;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the Data Block Length command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32BlockLen             Block length
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD16_SetBlockLength(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32BlockLen, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = u32BlockLen;
        stcCmdConfig.u16CmdIndex        = SDIOC_CMD16_SET_BLOCKLEN;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_DISABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R1_R5_R6_R7;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the Read Single Block command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32ReadAddr             Data address
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD17_ReadSingleBlock(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32ReadAddr, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = u32ReadAddr;
        stcCmdConfig.u16CmdIndex        = SDIOC_CMD17_READ_SINGLE_BLOCK;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_ENABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R1_R5_R6_R7;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the Read Multi Block command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32ReadAddr             Data address
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD18_ReadMultipleBlock(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32ReadAddr, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = u32ReadAddr;
        stcCmdConfig.u16CmdIndex        = SDIOC_CMD18_READ_MULTI_BLOCK;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_ENABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R1_R5_R6_R7;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrStatus);
        }
    }

    return i32Ret;
}

