RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_sdioc.c
/**
 * @brief  Send the Write Single Block command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32WriteAddr            Data address
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD24_WriteSingleBlock(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32WriteAddr, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = u32WriteAddr;
        stcCmdConfig.u16CmdIndex        = SDIOC_CMD24_WRITE_SINGLE_BLOCK;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_ENABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R1_R5_R6_R7;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the Write Multi Block command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32WriteAddr            Data address
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD25_WriteMultipleBlock(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32WriteAddr, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = u32WriteAddr;
        stcCmdConfig.u16CmdIndex        = SDIOC_CMD25_WRITE_MULTI_BLOCK;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_ENABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R1_R5_R6_R7;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the Start Address Erase command for SD and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32StartAddr            The start address will be erased
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD32_EraseBlockStartAddr(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32StartAddr, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = u32StartAddr;
        stcCmdConfig.u16CmdIndex        = SDIOC_CMD32_ERASE_WR_BLK_START;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_DISABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R1_R5_R6_R7;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the End Address Erase command for SD and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32EndAddr              The end address will be erased
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD33_EraseBlockEndAddr(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32EndAddr, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = u32EndAddr;
        stcCmdConfig.u16CmdIndex        = SDIOC_CMD33_ERASE_WR_BLK_END;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_DISABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R1_R5_R6_R7;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the Erase command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD38_Erase(CM_SDIOC_TypeDef *SDIOCx, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = 0UL;
        stcCmdConfig.u16CmdIndex        = SDIOC_CMD38_ERASE;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_DISABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R1B_R5B;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp1Busy(SDIOCx, SDMMC_MAX_ERASE_TIMEOUT, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the Application command to verify that that the next command
 *         is an application specific command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32Argument             Argument used for the command.
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD55_AppCmd(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32Argument, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = u32Argument;
        stcCmdConfig.u16CmdIndex        = SDIOC_CMD55_APP_CMD;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_DISABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R1_R5_R6_R7;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the Bus Width command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32BusWidth             The data bus width
 *         This parameter can be one of the following values:
 *           @arg SDMMC_SCR_BUS_WIDTH_1BIT: 1 bit bus
 *           @arg SDMMC_SCR_BUS_WIDTH_4BIT: 4 bits bus
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_ACMD6_SetBusWidth(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32BusWidth, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = u32BusWidth;
        stcCmdConfig.u16CmdIndex        = SDIOC_ACMD6_SET_BUS_WIDTH;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_DISABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R1_R5_R6_R7;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the Status register command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_ACMD13_SendStatus(CM_SDIOC_TypeDef *SDIOCx, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = 0UL;
        stcCmdConfig.u16CmdIndex        = SDIOC_ACMD13_SD_STATUS;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_ENABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R1_R5_R6_R7;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the command asking the accessed card to send its operating condition register(OCR).
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32Argument             Argument used for the command.
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_ACMD41_SendOperatCond(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32Argument, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = u32Argument | SDMMC_ACMD41_VOLT_WIN;
        stcCmdConfig.u16CmdIndex        = SDIOC_ACMD41_SD_APP_OP_COND;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_DISABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R3_R4;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp3(SDIOCx, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the Send SCR command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_ACMD51_SendSCR(CM_SDIOC_TypeDef *SDIOCx, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = 0UL;
        stcCmdConfig.u16CmdIndex        = SDIOC_ACMD51_SEND_SCR;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_ENABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R1_R5_R6_R7;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @brief  Sends host capacity support information command.
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32Argument             Argument used for the command.
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD1_SendOperatCond(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32Argument, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = u32Argument;
        stcCmdConfig.u16CmdIndex        = SDIOC_CMD1_SEND_OP_COND;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_DISABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R3_R4;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp3(SDIOCx, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the Start Address Erase command and check the response
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32StartAddr            The start address will be erased
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD35_EraseGroupStartAddr(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32StartAddr, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = u32StartAddr;
        stcCmdConfig.u16CmdIndex        = SDIOC_CMD35_ERASE_GROUP_START;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_DISABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R1_R5_R6_R7;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @brief  Send the End Address Erase command and check the response
 * @param  [in] SDIOCx                  Pointer to SDIOC unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_SDIOC1:            SDIOC unit 1 instance
 *           @arg CM_SDIOC2:            SDIOC unit 2 instance
 * @param  [in] u32EndAddr              The end address will be erased
 * @param  [out] pu32ErrStatus          Pointer to the error state value
 * @retval int32_t:
 *           - LL_OK: Command send completed
 *           - LL_ERR: Refer to pu32ErrStatus for the reason of error
 *           - LL_ERR_INVD_PARAM: SDIOCx == NULL or pu32ErrStatus == NULL
 *           - LL_ERR_TIMEOUT: Wait timeout
 */
int32_t SDMMC_CMD36_EraseGroupEndAddr(CM_SDIOC_TypeDef *SDIOCx, uint32_t u32EndAddr, uint32_t *pu32ErrStatus)
{
    int32_t i32Ret;
    stc_sdioc_cmd_config_t stcCmdConfig;

    if (NULL == pu32ErrStatus) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        stcCmdConfig.u32Argument        = u32EndAddr;
        stcCmdConfig.u16CmdIndex        = SDIOC_CMD36_ERASE_GROUP_END;
        stcCmdConfig.u16CmdType         = SDIOC_CMD_TYPE_NORMAL;
        stcCmdConfig.u16DataLine        = SDIOC_DATA_LINE_DISABLE;
        stcCmdConfig.u16ResponseType    = SDIOC_RESP_TYPE_R1_R5_R6_R7;
        i32Ret = SDIOC_SendCommand(SDIOCx, &stcCmdConfig);
        /* Check for error conditions */
        if (LL_OK == i32Ret) {
            i32Ret = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrStatus);
        }
    }

    return i32Ret;
}

/**
 * @}
 */

#endif /* LL_SDIOC_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
